Repository: kekewong/dj-react
Catalog: tj-learn-react-backend/ReactLeaning.Api/Resources/SharedResources.*.resx
Languages: ms_my, zh

# PleaseInputPhoneNo
source: Please Input Mobile Number
ms_my: Sila Masukkan Nombor Mudah Alih
zh: 请输入手机号码

# PleaseInputUniqueKey
source: Please Input Receipt Number
ms_my: Sila Masukkan Nombor Receipt
zh: 请输入白单号码

# InvalidUniqueKey
source: Invalid Receipt Number
ms_my: Nombor Receipt tidak boleh guna
zh: 白单号码不能被使用

# NotAbleToVoidDueToHours
source: Not able to void this attendance due to date overdue
zh: 白单已经超过撤除期限

# InvalidPhoneNoOrOtp
source: Invalid Mobile Number Or Otp
ms_my: Nombor Mudah Alih Atau OTP Tidak Sah
zh: 手机号码或一次性密码无效

source: Invalid Login Count Exceeded
ms_my: Kiraan Log Masuk Tidak Sah Melebihi
zh: 超过无效登录计数

source: Invalid Permission
ms_my: Kebenaran Tidak Sah
zh: 无效的权限

source: Please Input Password
ms_my: Sila Masukkan Kata Laluan
zh: 请输入密码

source: Please input old password
ms_my: Sila masukkan kata laluan yang lama
zh: 请输入旧密码

source: Old password invalid
ms_my: Kata laluan lama tidak sah
zh: 旧密码不正确

source: Invalid Username Or Password
ms_my: Nama pengguna atau kata laluan tidak sah
zh: 用户名或密码无效

source: Please Input Branch Code
ms_my: Sila Input Kod Cawangan
zh: 请输入分行代码

source: Please input merchant type
ms_my: Sila masukan merchant type
zh: 请输入用户类型

source: Please input branch
ms_my: Sila masukan branch
zh: 请输入分支

source: Please input username
ms_my: Sila masukan username
zh: 请输入账号

# UsernameExists
source: Username not available, please use another username
ms_my: Username tidak sah, sila gula username lain
zh: 账号无法使用, 请输入另外账号

source: Invalid operation
ms_my: Operasi tidak sah
zh: 操作不正确

source: Invalid Branch Code
ms_my: Kod Cawangan Tidak Sah
zh: 无效的分支代码

# PasswordAndConfirmPasswordMustMatch
source: Invalid Confirm Password
ms_my: Kata Laluan tidak sah
zh: 确认密码与密码不一致

source: Invalid Code
ms_my: Kod tidak sah
zh: 无效的代码

source: Invalid MerchantId
ms_my: MerchantId tidak sah
zh: 无效的商家ID

# UserIsNotMember
source: User haven't join member
ms_my: Pengguna belum menyertai ahli
zh: 用户尚未加入会员

source: Invalid BranchId
ms_my: Cawangan Id tidak sah
zh: 无效的分支ID

# AmountGreaterThan0
source: Amount Should Be Greater Than 0
ms_my: Amaun Harus Lebih Daripada 0
zh: 金额应大于0

source: Balance Insufficient
ms_my: Baki Tidak Mencukupi
zh: 余额不足

# MaximumCharacterLength30
source: Maximum Character Length Is 30
ms_my: Panjang Aksara Maksimum ialah 30
zh: 最大字符长度为30

# PhoneNumberWasTaken
source: Mobile Number Was Registered
ms_my: Nombor Mudah Alih Telah Didaftarkan
zh: 手机号码已注册

source: Please Input Name
ms_my: Sila Masukkan Nama
zh: 请输入姓名

source: Please Input Passport
ms_my: Sila Masukkan Passport
zh: S请输入护照号码

# InvalidPhoneNo
source: Invalid Mobile Number
ms_my: Nombor Telefon tidak sah
zh: 电话号码错误

# MaximumCharacterLength50
source: Maximum Character Length Is 50
ms_my: Panjang Aksara Maksimum ialah 50
zh: 最大字符长度为50

source: Please Request Later
ms_my: Sila Minta Kemudian
zh: 请稍后申请

source: User Already Verified
ms_my: Pengguna Sudah Disahkan
zh: 用户已验证

source: Invalid OTP
ms_my: OTP tidak sah
zh: 无效的一次性密码

# OtpSmsNew
source: Welcome to UNI! Your OTP is {0}.
ms_my: Selamat Datang Ke UNI. OTP anda adalah {0}.
zh: 欢迎来到UNI.您的一次性密码是{0}.

# LoginOtp
source: Login attempt! Your OTP is {0} .
ms_my: Daftar Masuk! OTP anda adalah {0} .
zh: 您的一次性登入密码是{0} .

source: Invalid Payment Id
ms_my: Id Pembayaran Tidak Sah
zh: 无效的付款ID

source: Invalid TopUp Id
ms_my: Id Tambah Nilai Tidak Sah
zh: 无效的充值ID

# PaymentIsVoided
source: Payment has been voided
ms_my: Bayaran telah dibatalkan
zh: 付款已作废

# TopUpIsVoided
source: Top Up record has been voided
ms_my: Record tambah nilai telah dibatalkan
zh: 充值记录已作废

# AfterVoidShouldNotBalanceZero
source: Insufficient wallet balance to void the transaction
ms_my: Baki tidak mengcukupi selepas bayaran dibatalkan
zh: 充值记录取消后钱包余额不足

source: Only Branch Manager Can Create Package
ms_my: Hanya Pengurus Cawangan Boleh Membuat Pakej
zh: 只有分行经理可以创建配套

source: Only branch manager can reset password
ms_my: Hanya Pengurus Cawangan boleh menukar password
zh: 只有分行经理可以更换密码

# OnlyAbleToResetSameMerchantUser
source: Target user not in same merchant
ms_my: Tidak Sah
zh: 用户不匹配

source: Please Input Package Name
ms_my: Sila Masukkan Nama Pakej
zh: 请输入配套名称

# QuantityGreaterThan1
source: Quantity Should Be Greater Than 1
ms_my: Kuantiti Mesti Lebih Daripada 1
zh: 数量必须大于1

# VoucherPriceGreaterThan0
source: Voucher #{0} Price Should Be Greater Than 0
ms_my: Harga Baucar #{0} Mesti Lebih Daripada 0
zh: 优惠券#{0}价格必须大于 0

# PriceGreaterThan0
source: Price Should Be Greater Than 0
ms_my: Harga Harus Lebih Daripada 0
zh: 价格应大于0

source: Invalid Package Id
ms_my: Pakej Id tidak sah
zh: 无效的配套ID

source: Used Package Cannot Be Edited
ms_my: Pakej Terpakai tidak boleh diedit
zh: 已用配套无法编辑

# PackageHasExpired
source: Package Already Expired
ms_my: Pakej Sudah Tamat Tempoh
zh: 配套已过期

source: Package Is Inactive
ms_my: Pakej Tidak Aktif
zh: 配套已停止使用

# PackageAlreadyUsedUp
source: Packages Was Used Up
ms_my: Pakej Dah Habis
zh: 配套已用完

source: Invalid Voucher Id
ms_my: Id Baucar Tidak Sah
zh: 优惠券ID无效

# VoucherIsVoided
source: Voucher Was Voided
ms_my: Baucar Telah Dibatalkan
zh: 优惠券作废

# VoucherIsUsed
source: Voucher Was Used
ms_my: Baucar Telah Digunakan
zh: 优惠券已使用

# VoucherIsExpired
source: Voucher Was Expired
ms_my: Baucar telah Tamat Tempoh
zh: 优惠券已过期

source: Please Input Title
ms_my: Sila Masukkan Tajuk
zh: 请输入标题

source: Invalid Voucher Id
ms_my: Baucar Id Tidak Sah
zh: 无效的优惠券ID

source: Please Input OTP
ms_my: Sila Input OTP
zh: 请输入一次性密码

# UserWalletAdded
source: User already registered to merchant
ms_my: Customer sudah register dalam merchant
zh: 顾客已经在商家注册了

source: Invalid Password
ms_my: Kata Laluan tidak sah
zh: 密码无效

source: Invalid Counter Password
ms_my: Kata Laluan Kaunter Tidak Sah
zh: 无效的柜台密码

source: Invalid Manager Password
ms_my: Kata Laluan Manager Tidak Sah
zh: 无效的经理密码

source: Please input Voucher Name
ms_my: Sila masukkan name baucar
zh: 请输入优惠券

source: Only Branch Manager Can Create Voucher
ms_my: Hanya Pengurus Cawangan Boleh Membuat Baucar
zh: 只有分行经理可以创建优惠券

source: Used Voucher Cannot Be Edited
ms_my: Baucer Terpakai tidak boleh diedit
zh: 已用优惠券包无法编辑

source: Invalid Customer Voucher Id
ms_my: ID Baucar Pelanggan Tidak Sah
zh: 无效的优惠券ID

# CustomerVoucherIsVoided
source: Customer Voucher Already Voided
ms_my: Baucar Pelanggan Telah Dibatalkan
zh: 优惠券已经无效

# CustomerVoucherIsUsed
source: Customer Voucher Already Used
ms_my: Baucar Pelanggan Telah Digunakan
zh: 优惠券已使用

# VoucherInactive
source: Voucher Is Inactive
ms_my: Baucar tidak aktif
zh: 优惠券非活跃

# VoucherUsedUp
source: Voucher already used up
ms_my: Baucar telah habis
zh: 优惠券已经用完

# AtleastOnePackageItem
source: Please Create At Least One Item
ms_my: Sila Cipta Sekurang-kurangnya Satu Item Pakej
zh: 请创建至少一个配套物品

# PackageItemPriceGreaterThan0
source: Package Item #{0} Price Should Be Greater Than 0
ms_my: Harga Item #{0} Mesti Lebih Daripada 0
zh: 物品#{0}价格必须大于 0

# PackageItemQuantityGreaterThan1
source: Package Item #{0} Quantity Should Be Greater Than 1
ms_my: Kuantiti Item #{0} Mesti Lebih Daripada 1
zh: 物品#{0}数量必须大于 1

# PackageItemIsExpired
source: Package Item Was Expired
ms_my: Item Pakej Telah Taman Tempoh
zh: 配套物品已过期

# PackageItemIsUsed
source: Package Item Was Used
ms_my: Item Pakej Telah Diguna
zh: 配套物品已使用

# PackageItemIsVoided
source: Package Item Was Voided
ms_my: Item Pakej Telah Dibatalkan
zh: 配套物品已无效

source: Invalid Package Item Id
ms_my: Item Pakej Id tidak sah
zh: 无效的配套物品ID

# CustomerPackageIsVoid
source: Customer Package Was Voided
ms_my: Pakej Pelanggan Telah Dibatalkan
zh: 客户配套已经无效

source: Invalid Customer Package Id
ms_my: Id Pakej Pelanggan Tidak Sah
zh: 无效的客户配套ID

# AtleastOnePackageItemSelected
source: Please Select At Least One Item
ms_my: Sila Pilih Sekurang-kurangnya Satu Item
zh: 请选择至少一个配套物品

# InvalidPostId
source: Invalid Promotion Id
ms_my: Id Promosi Tidak Sah
zh: 促销ID无效

# DuplicatePassportProfile
source: Duplicate passport found ! Please use the search passport function
zh: 护照号码已经注册了, 请用查询护照功能查询会员

# SendingLimitExceed
source: Sending Limit Exceeded
ms_my: Had Penghantaran Melebihi
zh: 发送限制超出

# MaximumTitleLength500
source: Maximum Character Length For Title Is 500
ms_my: Panjang Aksara Maksimum untuk Tajuk ialah 500
zh: 标题的最大字符长度为 500

source: Invalid Action
ms_my: Tindakan tidak sah
zh: 无效动作

source: Only Member can delete account
ms_my: Hanya ahli boleh memadam akaun
zh: 只有会员可以删除帐户

# LoginFail
source: Phone No is not registered in our system
ms_my: No Telefon tidak didaftarkan dalam sistem kami
zh: 电话号码未在我们的系统中注册
